# Speckle Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Speckle Class
Members See Also
---
A static class that provides access to the property names that appear in the Speckle visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Speckle
```

Visual Basic
---
```text
Public NotInheritable Class Speckle
```

Visual C++
---
```text
public ref class Speckle abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Speckle
# See Also
Speckle Members
Autodesk.Revit.DB.Visual Namespace